# StartHubId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalLink..::..StartHubId Property
AnalyticalLink Class See Also
---
Hub ID at start of AnalyticalLink.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId StartHubId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartHubId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ StartHubId {
	ElementId^ get ();
}
```

# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace